code-review/NRB_3471_3546/База_Было/Documents/НачисленныйНалог.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>НачисленныйНалог</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.НалоговаяБазаВыплатыДоходов</xr:Item>
				<xr:Item>AccumulationRegister.ДенежныеСредства</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Поручение</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Депонент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДепо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДепо</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазделСчетаДепо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РазделыСчетаДепо</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ставка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаНалога</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КурсВалюты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КратностьВалюты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаНалогаПоСтавке15СПревышения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Документ1СИЦ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НалоговаяБаза</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоэффициентД1</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>23</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоэффициентД2</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>23</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подтвержден</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаВыплаты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Резидент</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаЗачетНалогаНаПрибыль</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БазаДляРасчетаЗНП</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаНачисленныйНалогОбычнаяСтавка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаНачисленныйНалогПовышеннаяСтавка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Эмитент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаКВыплатеПоОсновнаяСтавка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаКВыплатеПоПовышеннаяСтавка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтавкаНалогаПовышенная</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаОкругленияНалога</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>7</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтавкаИПДНалогаВИностраннойЮрисдикции</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.СтавкаНалога</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаЗачетНалогаВИностраннойЮрисдикции</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтавкаНалогаСОИДН</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.СтавкаНалога</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаНалогаВИностраннойЮрисдикции</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>18</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтавкиНалогаУстановленыВРучномРежиме</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаОкругленияВыплат</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>7</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

code-review/NRB_3471_3546/База_Было/Documents/НачисленныйНалог/Forms/ФормаДокумента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если ОбщегоНазначенияПовтИсп.ЗначениеКонстанты("РасчетНалогаПоДивидендамВСистеме")
		Или ОбщегоНазначенияПовтИсп.ЗначениеКонстанты("РасчетНалогаПоКупонамВСистеме") Тогда
		
			Элементы.Документ1СИЦ.Видимость = Ложь;
		
	Иначе
		
			Элементы.ГруппаРасчеты.Видимость = Ложь;
		
			Элементы.Подтвержден.Видимость = Ложь;
		
			Элементы.ФормаРассчитатьНалог.Видимость = Ложь;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Страна = СтранаЭмитента(Объект.Эмитент);
	УстановитьВидимостьИДоступностьЭлементов();
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	Оболочки.ПриЧтенииНаСервереДокумента(ЭтотОбъект, ТекущийОбъект);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	
	ДатаПриИзмененииНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура СтавкиНалогаУстановленыВРучномРежимеПриИзменении(Элемент)
	
	ДатаПриИзмененииНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура СтавкаПриИзменении(Элемент)
	
	ДатаПриИзмененииНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура СтавкаНалогаПовышеннаяПриИзменении(Элемент)
	
	ДатаПриИзмененииНаСервере();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура РассчитатьНалог(Команда)
	
	РассчитатьНалогНаСервере();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция СтранаЭмитента(Эмитент)
	
	Возврат Справочники.КлассификаторСтранМира.СтранаЭмитента(Эмитент);
	
КонецФункции

&НаСервере
Процедура УстановитьВидимостьИДоступностьЭлементов()
	
	Если Объект.Проведен И Не Объект.Подтвержден Тогда
		РасхожденияПоПричинеНеподтвержденныхНалогов = Документы.НачисленныйНалог.ИнформацияОРанееНеподтвержденныхНалогах(Объект.Ссылка);
		ЕстьНеподтвержденныеНалоги = ЗначениеЗаполнено(РасхожденияПоПричинеНеподтвержденныхНалогов);
		РасхожденияПоПричинеПодтвержденныхНалогов = Документы.НачисленныйНалог.ИнформацияОПодтвержденныхНалогахПозжеТекущего(Объект.Ссылка);
		ЕстьПодтвержденныеНалоги = ЗначениеЗаполнено(РасхожденияПоПричинеПодтвержденныхНалогов);
		Если ЕстьНеподтвержденныеНалоги Тогда
			РасхожденияРасчетаНалога = РасхожденияПоПричинеНеподтвержденныхНалогов;
		ИначеЕсли ЕстьПодтвержденныеНалоги Тогда
			РасхожденияРасчетаНалога = РасхожденияПоПричинеПодтвержденныхНалогов;
		Иначе
			РасхожденияРасчетаНалога = Документы.НачисленныйНалог.ИнформацияОКорректностиРасчетаНалога(Объект.Ссылка, Объект);
		КонецЕсли;
		УстановитьВидимостьИДоступностьГруппыПересчетаНалога(РасхожденияРасчетаНалога, ЕстьНеподтвержденныеНалоги, ЕстьПодтвержденныеНалоги);
		Элементы.СтавкиНалогаУстановленыВРучномРежиме.Доступность = Истина;
	Иначе
		Элементы.ГруппаПересчета.Видимость = Ложь;
		Элементы.ПересчитатьНалог.Видимость = Ложь;
		Элементы.Подтвержден.Доступность = Истина;
		Элементы.ФормаРассчитатьНалог.Видимость = Истина;
		Элементы.СтавкиНалогаУстановленыВРучномРежиме.Доступность = Ложь;
	КонецЕсли;
	ДоходВРублях = (Объект.Валюта = ОбщегоНазначенияПовтИсп.ЗначениеКонстанты("ВалютаРегламентированногоУчета")
		Или Не ЗначениеЗаполнено(Объект.Валюта));
	Элементы.ГруппаНалогиСредняя.Видимость = Не ДоходВРублях;
	Элементы.СуммаЗачетНалогаВИностраннойЮрисдикции.Видимость = Не ДоходВРублях;
	Элементы.ДекорацияГруппаНалогиСредняя.Видимость = ДоходВРублях;
	Элементы.СуммаОкругленияВыплат.Видимость = Не ДоходВРублях И Объект.СуммаОкругленияВыплат <> 0;
	
	Элементы.Ставка.Доступность = Объект.СтавкиНалогаУстановленыВРучномРежиме;
	Элементы.СтавкаНалогаПовышенная.Доступность = Объект.СтавкиНалогаУстановленыВРучномРежиме;
	Если Объект.СтавкиНалогаУстановленыВРучномРежиме Тогда
		Элементы.Ставка.ЦветФона = WebЦвета.СветлоЗолотистый;
		Элементы.СтавкаНалогаПовышенная.ЦветФона = WebЦвета.СветлоЗолотистый;
	Иначе
		Элементы.Ставка.ЦветФона = WebЦвета.Белый;
		Элементы.СтавкаНалогаПовышенная.ЦветФона = WebЦвета.Белый;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьИДоступностьГруппыПересчетаНалога(РасхожденияРасчетаНалога,
	ЕстьНеподтвержденныеНалоги, ЕстьПодтвержденныеНалоги)
	
	Если ЗначениеЗаполнено(РасхожденияРасчетаНалога) Тогда
		Элементы.ГруппаПересчета.Показать();
		Элементы.ГруппаПересчета.ЦветТекстаЗаголовка = ЦветаСтиля.ЦветОсобогоТекста;
		Если ЕстьНеподтвержденныеНалоги Тогда
			Элементы.ГруппаПересчета.Заголовок = "По данному клиенту есть не подтвержденные выплаты в рамках налоговой базы";
			Элементы.ПересчитатьНалог.Видимость = Ложь;
			Элементы.ФормаРассчитатьНалог.Видимость = Ложь;
		ИначеЕсли ЕстьПодтвержденныеНалоги Тогда
			Элементы.ГруппаПересчета.Заголовок = "По данному клиенту есть подтвержденные выплаты (в будущем) в рамках налоговой базы";
			Элементы.ПересчитатьНалог.Видимость = Ложь;
			Элементы.ФормаРассчитатьНалог.Видимость = Ложь;
		Иначе
			Элементы.ГруппаПересчета.Заголовок = "Требуется пересчет налога";
			Элементы.ПересчитатьНалог.Видимость = Истина;
			Элементы.ФормаРассчитатьНалог.Видимость = Истина;
		КонецЕсли;
		Элементы.Подтвержден.Доступность = Ложь;
	Иначе
		Элементы.ГруппаПересчета.Скрыть();
		Элементы.ГруппаПересчета.ЦветТекстаЗаголовка = ЦветаСтиля.ЦветТекстаКнопки;
		Элементы.ГруппаПересчета.Заголовок = "Нет расхождений";
		Элементы.ПересчитатьНалог.Видимость = Ложь;
		Элементы.Подтвержден.Доступность = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура РассчитатьНалогНаСервере()
	
	ДокументОбъект = РеквизитФормыВЗначение("Объект");
	
	ДокументОбъект.Заполнить(Неопределено);
	
	ЗначениеВРеквизитФормы(ДокументОбъект, "Объект");
	
	УстановитьВидимостьИДоступностьЭлементов();
	
КонецПроцедуры

&НаСервере
Процедура ДатаПриИзмененииНаСервере()
	
	Если Не Объект.Подтвержден Тогда
		Если Объект.Проведен Тогда
			ДокОбъект = РеквизитФормыВЗначение("Объект");
			ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
			ЗначениеВРеквизитФормы(ДокОбъект, "Объект");
		Иначе
			Записать();
		КонецЕсли;
		Модифицированность = Ложь;
	КонецЕсли;
	УстановитьВидимостьИДоступностьЭлементов();
	
КонецПроцедуры

#КонецОбласти
